type CollectEggsCSV = {
  "วัน เดือน ปี": string;
  "น้ำหนักอาหารแถว A (กก.)": string;
  "น้ำหนักอาหารแถว B (กก.)": string;
  "น้ำหนักอาหารแถว C (กก.)": string;
  "น้ำหนักอาหารแถว D (กก.)": string;
  "น้ำหนักอาหารรวม (กก.)": string;
  "จำนวนไข่แถว A (ฟอง)": string;
  "จำนวนไข่แถว B (ฟอง)": string;
  "จำนวนไข่แถว C (ฟอง)": string;
  "จำนวนไข่แถว D (ฟอง)": string;
  "จำนวนไข่รวม (ฟอง)": string;
  "น้ำหนักไข่รวม (กรัม)": string;
  "น้ำหนักไข่เฉลี่ยต่อฟอง (กรัม)": string;
  "จำนวนไข่เบอร์ 4 (แผง)": string;
  "จำนวนไข่เบอร์ 4 สะสม (แผง)": string;
  "จำนวนไข่เบอร์ 3 (แผง)": string;
  "จำนวนไข่เบอร์ 3 สะสม (แผง)": string;
  "จำนวนไข่เบอร์ 2 (แผง)": string;
  "จำนวนไข่เบอร์ 2 สะสม (แผง)": string;
  "จำนวนไข่เบอร์ 1 (แผง)": string;
  "จำนวนไข่เบอร์ 1 สะสม (แผง)": string;
  "จำนวนไข่เบอร์ 0 (แผง)": string;
  "จำนวนไข่เบอร์ 0 สะสม (แผง)": string;
  "จำนวนไข่รวม (แผง)": string;
  "จำนวนไข่สะสม (แผง)": string;
  "จำนวนไข่คงเหลือ (ฟอง)": string;
};

type SellEggsCSV = {
  "วัน เดือน ปี": string;
  "ขายไข่เบอร์ 4 (แผง)": string;
  "ขายไข่เบอร์ 4 (บาท)": string;
  "ไข่เบอร์ 4 คงเหลือ (แผง)": string;
  "ขายไข่เบอร์ 3 (แผง)": string;
  "ขายไข่เบอร์ 3 (บาท)": string;
  "ไข่เบอร์ 3 คงเหลือ (แผง)": string;
  "ขายไข่เบอร์ 2 (แผง)": string;
  "ขายไข่เบอร์ 2 (บาท)": string;
  "ไข่เบอร์ 2 คงเหลือ (แผง)": string;
  "ขายไข่เบอร์ 1 (แผง)": string;
  "ขายไข่เบอร์ 1 (บาท)": string;
  "ไข่เบอร์ 1 คงเหลือ (แผง)": string;
  "ขายไข่เบอร์ 0 (แผง)": string;
  "ขายไข่เบอร์ 0 (บาท)": string;
  "ไข่เบอร์ 0 คงเหลือ (แผง)": string;
  "ขายไข่ทั้งหมด (แผง)": string;
  "ขายไข่ทั้งหมด (บาท)": string;
  "ไข่ทั้งหมดที่เหลือ (แผง)": string;
};

type AccountingCSV = {
  "วัน เดือน ปี": string;
  รายการ: string;
  รายรับ: string;
  "รายจ่าย ": string;
  คงเหลือ: string;
};

export type { CollectEggsCSV, SellEggsCSV, AccountingCSV };
